// Имущество (драгоценное имущество) стоимостью более четырех миллионов драмов или эквивалента в иностранной валюте, фактически находящееся в распоряжении декларанта в течение более 90 дней в течение отчетного периода, или приобретенное от имени, в пользу или за счет декларанта, драгоценное имущество, принадлежащее третьему лицу на праве собственности, или драгоценное имущество, от которого он получает фактическую выгоду, или этим имуществом распоряжается декларант
export interface b_5_2_DeclarantValuableProperty {
    numbering: number | null; // "NN ը/կ"
    declarantName: string; // "Հայտարարատուի անունը, ազգանունը, հայրանունը"
    propertyType: string; // "Թանկարժեք գույքի տեսակը"
    description: string; // "Թանկարժեք գույքի նկարագրությունը"
    valueAndCurrency: string; // "Գինը(արժեքը) և արժույթը"
    ownerName: string; // "Գույքի սեփականատիրոջ անվանումը կամ անունը, ազգանունը, հայրանունը"
    relationship: string; // "Հայտարարատուի և սեփականատիրոջ միջև առկա կապի բնույթը"
}

export const parseDeclarantValuableProperties = (
    rows: string[][]
): b_5_2_DeclarantValuableProperty[] => {
    return rows.map((row) => ({
        numbering: parseInt(row[0], 10) || null, // "NN ը/կ"
        declarantName: row[1] || "", // "Հայտարարատուի անունը, ազգանունը, հայրանունը"
        propertyType: row[2] || "", // "Թանկարժեք գույքի տեսակը"
        description: row[3] || "", // "Թանկարժեք գույքի նկարագրությունը"
        valueAndCurrency: row[4] || "", // "Գինը(արժեքը) և արժույթը"
        ownerName: row[5] || "", // "Գույքի սեփականատիրոջ անվանումը կամ անունը, ազգանունը, հայրանունը"
        relationship: row[6] || "", // "Հայտարարատուի և սեփականատիրոջ միջև առկա կապի բնույթը"
    }));
};
