export interface b_6_4_ThirdPartyElectronicAccountCrypto {
    numbering: number | null; // "NN ը/կ"
    declarantName: string; // "Հայտարարատուի անունը, ազգանունը, հայրանունը"
    accountOrCryptoType: string; // "Պաշտոնի ստանձնման կամ դադարեցման օրվա դրությամբ առկա էլեկտրոնային հաշվի կամ կրիպտոարժույթի տեսակը"
    balanceAndCurrency: string; // "Պաշտոնի ստանձնման կամ դադարեցման օրվա դրությամբ առկա էլեկտրոնային հաշվի կամ կրիպտոարժույթի գումարը և արժույթը"
    sourceOfFunds: string; // "Պաշտոնի ստանձնման կամ դադարեցման օրվա դրությամբ առկա էլեկտրոնային հաշվի կամ կրիպտոարժույթի ծագման աղբյուրը"
    ownerName: string; // "Էլեկտրոնային հաշիվների և կրիպտոարժույթի սեփականատիրոջ անվանումը կամ անունը, ազգանունը, հայրանունը"
    relationshipNature: string; // "Հայտարարատուի և երրորդ անձի միջև առկա կապի բնույթը"
}

export const parseThirdPartyElectronicAccountsAndCrypto = (
    rows: string[][]
): b_6_4_ThirdPartyElectronicAccountCrypto[] => {
    return rows.map((row) => ({
        numbering: parseInt(row[0], 10) || null, // "NN ը/կ"
        declarantName: row[1] || "", // "Հայտարարատուի անունը, ազգանունը, հայրանունը"
        accountOrCryptoType: row[2] || "", // "Պաշտոնի ստանձնման կամ դադարեցման օրվա դրությամբ առկա էլեկտրոնային հաշվի կամ կրիպտոարժույթի տեսակը"
        balanceAndCurrency: row[3] || "", // "Պաշտոնի ստանձնման կամ դադարեցման օրվա դրությամբ առկա էլեկտրոնային հաշվի կամ կրիպտոարժույթի գումարը և արժույթը"
        sourceOfFunds: row[4] || "", // "Պաշտոնի ստանձնման կամ դադարեցման օրվա դրությամբ առկա էլեկտրոնային հաշվի կամ կրիպտոարժույթի ծագման աղբյուրը"
        ownerName: row[5] || "", // "Էլեկտրոնային հաշիվների և կրիպտոարժույթի սեփականատիրոջ անվանումը կամ անունը, ազգանունը, հայրանունը"
        relationshipNature: row[6] || "", // "Հայտարարատուի և երրորդ անձի միջև առկա կապի բնույթը"
    }));
};
